{"class_name": "Functional", "config": {"name": "functional_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 24], "dtype": "float32", "sparse": false, "ragged": false, "name": "11611140306.089798"}, "name": "11611140306.089798", "inbound_nodes": []}, {"class_name": "LayerNormalization", "config": {"name": "21611140306.089798", "trainable": true, "dtype": "float32", "axis": [1], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "21611140306.089798", "inbound_nodes": [[["11611140306.089798", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "31611140306.089798", "trainable": true, "dtype": "float32", "units": 12, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "31611140306.089798", "inbound_nodes": [[["21611140306.089798", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "61611140306.089798", "trainable": true, "dtype": "float32", "units": 6, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "61611140306.089798", "inbound_nodes": [[["31611140306.089798", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "71611140306.089798", "trainable": true, "dtype": "float32", "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "71611140306.089798", "inbound_nodes": [[["61611140306.089798", 0, 0, {}]]]}], "input_layers": [["11611140306.089798", 0, 0]], "output_layers": [["71611140306.089798", 0, 0]]}, "keras_version": "2.4.0", "backend": "tensorflow"}